<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="input_features" type="Parameter" version="opset1">
			<data shape="?,128,3000" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input_features">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="self.conv1.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 128, 3" offset="0" size="491520" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Convert_975443" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.conv1.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1, 1" offset="491520" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Convert_975446" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="self.conv1.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="self.conv1.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1, 1" offset="492800" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="self.conv1.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="self.conv1.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.conv1/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.conv1/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1280, 1" offset="495360" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.conv1/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="131">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="aten::gelu/Gelu" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="73">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="self.conv2.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280, 3" offset="500480" size="4915200" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Convert_359585" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="self.conv2.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1, 1" offset="5415680" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Convert_359588" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="self.conv2.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="self.conv2.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1, 1" offset="5416960" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="self.conv2.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="self.conv2.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.conv2/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="2" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="__module.conv2/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1280, 1" offset="5419520" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module.conv2/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="143">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="aten::gelu/Gelu_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="76,inputs_embeds.1">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="aten::permute/Mod" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="5424640" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="81,inputs_embeds">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_19940" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1500, 1280" offset="5424664" size="7680000" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="83,input.1">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="13104664" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_19941" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="13104668" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_19942" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="13109788" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.layers.0.self_attn_layer_norm/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="166,hidden_states.1">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="self.layers.0.self_attn.q_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280" offset="13114908" size="1638400" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Convert_373907" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="self.layers.0.self_attn.q_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="14753308" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Convert_373910" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="self.layers.0.self_attn.q_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="self.layers.0.self_attn.q_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="14754588" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="self.layers.0.self_attn.q_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="self.layers.0.self_attn.q_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.layers.0.self_attn.q_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_19943" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="14757148" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.layers.0.self_attn.q_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="175,tensor.1">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_20779" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="14762268" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="177">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.layers.0.self_attn/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="14762300" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module.layers.0.self_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="178">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="self.layers.0.self_attn.k_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280" offset="14762316" size="1638400" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Convert_369133" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="self.layers.0.self_attn.k_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="16400716" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Convert_369136" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="self.layers.0.self_attn.k_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="self.layers.0.self_attn.k_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="16401996" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="self.layers.0.self_attn.k_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="self.layers.0.self_attn.k_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.layers.0.self_attn.k_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="181,tensor.3">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_20780" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="14762268" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.layers.0.self_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="183">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.layers.0.self_attn/aten::transpose/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="14762300" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.layers.0.self_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="184">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="self.layers.0.self_attn.v_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280" offset="16404556" size="1638400" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Convert_364359" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="self.layers.0.self_attn.v_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="18042956" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Convert_364362" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="self.layers.0.self_attn.v_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="self.layers.0.self_attn.v_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="18044236" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="self.layers.0.self_attn.v_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="self.layers.0.self_attn.v_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.layers.0.self_attn.v_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_19944" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="18046796" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.layers.0.self_attn.v_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="188,tensor.5">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_20781" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="14762268" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.layers.0.self_attn/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="190">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.layers.0.self_attn/aten::transpose/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="14762300" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.layers.0.self_attn/aten::transpose/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="191">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.layers.0.self_attn/aten::scaled_dot_product_attention/ScaledDotProductAttention" type="ScaledDotProductAttention" version="opset13">
			<data causal="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="193,attn_output.1">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.layers.0.self_attn/aten::transpose/Constant_3" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="14762300" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.layers.0.self_attn/aten::transpose/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="194,attn_output.3">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_20782" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="18051916" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.layers.0.self_attn/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="196">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="self.layers.0.self_attn.out_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280" offset="18051940" size="1638400" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Convert_378681" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="self.layers.0.self_attn.out_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="19690340" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Convert_378684" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="self.layers.0.self_attn.out_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="self.layers.0.self_attn.out_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="19691620" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="self.layers.0.self_attn.out_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="self.layers.0.self_attn.out_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.layers.0.self_attn.out_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_19945" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="19694180" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.layers.0.self_attn.out_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="199,input.3">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.layers.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="201,residual.3">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.layers.0.final_layer_norm/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="13104664" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.layers.0.final_layer_norm/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_19946" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="19699300" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.layers.0.final_layer_norm/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_19947" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="19704420" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.layers.0.final_layer_norm/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="205">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="self.layers.0.fc1.weight" type="Const" version="opset1">
			<data element_type="u8" shape="5120, 1280" offset="19709540" size="6553600" />
			<output>
				<port id="0" precision="U8">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Convert_54037" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="self.layers.0.fc1.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="5120, 1" offset="26263140" size="5120" />
			<output>
				<port id="0" precision="U8">
					<dim>5120</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Convert_54040" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>5120</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>5120</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="self.layers.0.fc1.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>5120</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="self.layers.0.fc1.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="5120, 1" offset="26268260" size="10240" />
			<output>
				<port id="0" precision="FP16">
					<dim>5120</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="self.layers.0.fc1.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>5120</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="self.layers.0.fc1.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.layers.0.fc1/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_19948" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 5120" offset="26278500" size="20480" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.layers.0.fc1/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>5120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="208">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.layers.0.activation_fn/aten::gelu/Gelu" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="209,input.5">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="self.layers.0.fc2.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 5120" offset="26298980" size="6553600" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Convert_58811" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="self.layers.0.fc2.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="32852580" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Convert_58814" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="self.layers.0.fc2.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="self.layers.0.fc2.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="32853860" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="self.layers.0.fc2.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="self.layers.0.fc2.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="__module.layers.0.fc2/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>5120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_19949" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="32856420" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="__module.layers.0.fc2/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="213,input.7">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.layers.0/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="215,residual.5">
					<dim>-1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="__module.layers.1.self_attn_layer_norm/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="13104664" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="__module.layers.1.self_attn_layer_norm/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
