<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="mel" type="Parameter" version="opset1">
			<data shape="1,128,3000" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="mel">
					<dim>1</dim>
					<dim>128</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 128, 3" offset="0" size="983040" />
			<output>
				<port id="0" precision="FP16" names="conv1.weight">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="node_conv1d/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280" offset="983040" size="2560" />
			<output>
				<port id="0" precision="FP16" names="conv1.bias">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_497" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="985600" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="ShapeOf_503" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="ShapeOf_495" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="ShapeOf_496" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_498" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="985608" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Subtract_499" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Broadcast_500" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Concat_504" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_505" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="node_conv1d" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv1d">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="node_gelu" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="gelu">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="conv2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1280, 3" offset="985616" size="9830400" />
			<output>
				<port id="0" precision="FP16" names="conv2.weight">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="node_conv1d_1/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv2.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280" offset="10816016" size="2560" />
			<output>
				<port id="0" precision="FP16" names="conv2.bias">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="conv2.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_511" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="985600" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="ShapeOf_517" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="ShapeOf_509" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="ShapeOf_510" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_512" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="985608" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Subtract_513" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Broadcast_514" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Concat_518" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_519" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="node_conv1d_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv1d_1">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="node_gelu_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="gelu_1">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_522" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="10818576" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="node_permute" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
					<dim>1500</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="permute">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="positional_embedding_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1500, 1280" offset="10818600" size="3840000" />
			<output>
				<port id="0" precision="FP16" names="positional_embedding">
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="positional_embedding" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="node_add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="add">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_527" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14658600" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="39" name="Constant_526" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14658608" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="40" name="Constant_525" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="985600" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="41" name="Range_528" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="MVN_529" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="blocks.0.attn_ln.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280" offset="14658616" size="2560" />
			<output>
				<port id="0" precision="FP16" names="blocks.0.attn_ln.weight">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="blocks.0.attn_ln.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Multiply_530" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="blocks.0.attn_ln.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280" offset="14661176" size="2560" />
			<output>
				<port id="0" precision="FP16" names="blocks.0.attn_ln.bias">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="blocks.0.attn_ln.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="node_layer_norm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer_norm">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="val_2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1280" offset="14663736" size="3276800" />
			<output>
				<port id="0" precision="FP16" names="val_2">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="val_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="node_MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_3">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="blocks.0.attn.query.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280" offset="17940536" size="2560" />
			<output>
				<port id="0" precision="FP16" names="blocks.0.attn.query.bias">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="blocks.0.attn.query.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="node_linear" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="val_12" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="17943096" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="val_12">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="node_view" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="view">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_538" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="17943128" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="node_permute_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="permute_1">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="val_48_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="17943160" size="2" />
			<output>
				<port id="0" precision="FP16" names="val_48">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="val_48" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="node_Mul_47" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_49">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="val_4_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1280" offset="17943162" size="3276800" />
			<output>
				<port id="0" precision="FP16" names="val_4">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="val_4" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="node_linear_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_1">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="node_view_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="view_1">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_541" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="17943128" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="node_permute_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="permute_2">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="val_43" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="21219962" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="val_43">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="node_Reshape_42" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_44">
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_547" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="10818576" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="node_Transpose_43" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_45">
					<dim>20</dim>
					<dim>64</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="val_46" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="21219986" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="val_46">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="node_Reshape_45" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>20</dim>
					<dim>64</dim>
					<dim>1500</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_47">
					<dim>1</dim>
					<dim>20</dim>
					<dim>64</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="node_Mul_50" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>64</dim>
					<dim>1500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_52">
					<dim>1</dim>
					<dim>20</dim>
					<dim>64</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="node_MatMul_51" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>64</dim>
					<dim>1500</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_53">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="node_Softmax_52" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>1500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="val_54">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="val_5_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1280" offset="21220018" size="3276800" />
			<output>
				<port id="0" precision="FP16" names="val_5">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="val_5" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="node_MatMul_4" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_6">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="blocks.0.attn.value.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280" offset="24496818" size="2560" />
			<output>
				<port id="0" precision="FP16" names="blocks.0.attn.value.bias">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="blocks.0.attn.value.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="node_linear_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_2">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="node_view_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="view_2">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_544" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="17943128" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="node_permute_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="permute_3">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="node_scaled_dot_product_attention" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>1500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="scaled_dot_product_attention">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_555" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="17943128" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="node_permute_4" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="permute_4">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="val_59" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="24499378" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="val_59">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="node_view_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="view_3">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="val_60_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1280" offset="24499402" size="3276800" />
			<output>
				<port id="0" precision="FP16" names="val_60">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="val_60" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="node_MatMul_59" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_61">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="blocks.0.attn.out.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280" offset="27776202" size="2560" />
			<output>
				<port id="0" precision="FP16" names="blocks.0.attn.out.bias">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="blocks.0.attn.out.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="node_linear_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_3">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="node_add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="add_1">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_563" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14658600" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="99" name="Constant_562" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14658608" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="100" name="Constant_561" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="985600" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="101" name="Range_564" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="MVN_565" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="blocks.0.mlp_ln.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280" offset="27778762" size="2560" />
			<output>
				<port id="0" precision="FP16" names="blocks.0.mlp_ln.weight">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="blocks.0.mlp_ln.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Multiply_566" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="blocks.0.mlp_ln.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280" offset="27781322" size="2560" />
			<output>
				<port id="0" precision="FP16" names="blocks.0.mlp_ln.bias">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="blocks.0.mlp_ln.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="node_layer_norm_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer_norm_1">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="val_64_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 5120" offset="27783882" size="13107200" />
			<output>
				<port id="0" precision="FP16" names="val_64">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="val_64" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="node_MatMul_61" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_65">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="blocks.0.mlp.0.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="5120" offset="40891082" size="10240" />
			<output>
				<port id="0" precision="FP16" names="blocks.0.mlp.0.bias">
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="blocks.0.mlp.0.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="node_linear_4" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>5120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_4">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="node_gelu_2" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="gelu_2">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="val_66_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="5120, 1280" offset="40901322" size="13107200" />
			<output>
				<port id="0" precision="FP16" names="val_66">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="val_66" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="node_MatMul_63" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>5120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>5120</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_67">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="blocks.0.mlp.2.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280" offset="54008522" size="2560" />
			<output>
				<port id="0" precision="FP16" names="blocks.0.mlp.2.bias">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="blocks.0.mlp.2.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="node_linear_5" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_5">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="node_add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="add_2">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_576" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14658600" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="124" name="Constant_575" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14658608" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="125" name="Constant_574" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="985600" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="126" name="Range_577" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="MVN_578" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="blocks.1.attn_ln.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280" offset="54011082" size="2560" />
			<output>
				<port id="0" precision="FP16" names="blocks.1.attn_ln.weight">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="blocks.1.attn_ln.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Multiply_579" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="blocks.1.attn_ln.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1280" offset="54013642" size="2560" />
			<output>
				<port id="0" precision="FP16" names="blocks.1.attn_ln.bias">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="blocks.1.attn_ln.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="node_layer_norm_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
